---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralFramingUtils
source: html/b2b99c67-62ac-e448-429a-636998770d07.htm
---
# StructuralFramingUtils Methods

Sets the indicated end of the framing element to be allowed to join to others.